---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricRoundingManager
source: html/6a6324cc-a18c-b883-1b1f-f2ad37147842.htm
---
# Autodesk.Revit.DB.Structure.FabricRoundingManager

Provides access to element reinforcement roundings overrides.

## Syntax (C#)
```csharp
public class FabricRoundingManager : ReinforcementRoundingManager
```

## Remarks
An instance of this class can be obtained from specific FabricSheetType or individual FabricSheet or FabricArea elements to apply overrides different from the global settings for the project.